using System;

namespace example_5
{
    class Program
    {
        static void Main(string[] args)
        {
            // Домашняя работа №1 пример_4
            // Архиреев Аркадий 
            /* 5. а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.
                б) *Сделать задание, только вывод организовать в центре экрана.
                в) **Сделать задание б с использованием собственных методов(например, Print(string ms, int x, int y).*/

        }
    }
}
